Revit 2024 API
RevisionSettings.GetRevisionSettings Method
 Returns the RevisionSettings for the given project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static RevisionSettings GetRevisionSettings(
	Document ccda
)
Visual Basic
Public Shared Function GetRevisionSettings ( _
	ccda As Document _
) As RevisionSettings
Visual C++
public:
static RevisionSettings^ GetRevisionSettings(
	Document^ ccda
)
Parameters
ccda
Type: Autodesk.Revit.DB.Document
 The document to get the RevisionSettings from.
Return Value
 The RevisionSettings for the document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  ccda is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace